Revit 2027 API
BuiltInFailures.CopyMonitorFailures.CannotMoveHostedFixtureViaCopyMonitor Property
 The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; }
Public Shared ReadOnly Property CannotMoveHostedFixtureViaCopyMonitor As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveHostedFixtureViaCopyMonitor {
	FailureDefinitionId^ get ();
}
static member CannotMoveHostedFixtureViaCopyMonitor : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyMonitorFailures Class
Autodesk.Revit.DB Namespace